Repository: El-Mundo/FaceClusterDX
Catalog: FaceCluster/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Value:
zh_hans: 取值:

source: , with %lld fails.
zh_hans: ，但%lld张面部的处理时出现错误。

source: %lld faces detected from the video
zh_hans: 从视频截取了%lld副面部

source: %lld frames expected.
zh_hans: 预计截取%lld帧。

# %lld texture batch(es) created, sized %lld
source: %1$lld texture batch(es) created, sized %2$lld
zh_hans: 创建了%1$lld个材质组，组围%2$lld

source: A deicmal number
zh_hans: 接受一个小数

source: A string (text)
zh_hans: 接受一句文本

source: Action:
zh_hans: 操作：

source: Align Faces
zh_hans: 校正面部图像

source: Aligned Image
zh_hans: 矫正预览

source: Aligning Display
zh_hans: 脸部矫正参数

source: All
zh_hans: 全部

source: An error occurred when fitting the CoreML model for Vision framework.
zh_hans: 由于CoreML模型注册Vision框架代理时出现不可预料的错误，分析失败。

source: An imported table must have the identifier attribute "%@" as preserved type.
zh_hans: 导入的表格必须有标记为Preserved类型的ID属性“%@”。

source: An integer
zh_hans: 接受一个整数

source: Analyse
zh_hans: 分析

source: Analysing images...
zh_hans: 正在分析图片...

source: Analyze every:
zh_hans: 分析间隔：

source: Assign Constant
zh_hans: 赋值为常量

source: Assigning:
zh_hans: 目标值：

source: Atrribute Name:
zh_hans: 属性名称：

source: Attribute Creation Error
zh_hans: 属性创建-错误

source: Attribute Dimensions (Vector only)
zh_hans: 维度（仅向量）

source: Attribute Name
zh_hans: 属性名称

source: Attribute name cannot be empty
zh_hans: 属性名称不能为空

source: Attribute:
zh_hans: 属性：

source: Attributes:
zh_hans: 属性：

source: Attributes: %lld
zh_hans: 属性：%lld

source: average
zh_hans: 平均数

source: Back
zh_hans: 返回

source: Background
zh_hans: 背景yanse

source: Batch size:
zh_hans: 批处理大小：

source: Broken data found:
zh_hans: 发现了损坏的面部数据：

source: Browse
zh_hans: 浏览

source: Calculate
zh_hans: 计算

source: Calculating face distances...
zh_hans: 计算脸部距离......

source: Calculation:
zh_hans: 运算符号：

source: Cancel
zh_hans: 取消

source: Cannot create a vector with negative or zero dimensions
zh_hans: 不能创建负数或零维度向量

source: Cannot create an attribute with an empty name
zh_hans: 不能创建空白名称属性

source: Cannot decode String "%@" as
zh_hans: 不能将文本"%@"转换为

source: Cannot delete the field used for display position in the network view.
zh_hans: 不能删除作为网络可视化定位参数的属性。

source: Cannot import a table without the first two lines recodring attributes.
zh_hans: 不能导入一个前两行未完整记录属性名称和类型的表格。

source: Cannot import an attribute with a preserved name and a non-preserved type for "%@".
zh_hans: 不能导入一个占有预留属性名称但类型不属于预留的数据列"%@"。

source: Cannot import the attribute name "%@" because it conflicts with an existing attribute in the network.
zh_hans: 不能导入属性"%@"，该名称已被网络已有属性使用。

source: Cannot locate the attribute data file
zh_hans: 不能读取属性数据文件

source: Cannot remove a preserved field from the network.
zh_hans: 不能网络中的移除预留类型。

source: Cannot switch mode when generating clusters.
zh_hans: 生成面部聚合时不能切换UI界面。

source: Cannot update face because it is not part of the active network.
zh_hans: 不能更新该面部，因为它不从属于当前编辑中的网络。

source: Checking:
zh_hans: 检查：

source: Clear Existing Selection
zh_hans: 清除现有选区

source: Cluster
zh_hans: 聚合

source: Clustered faces, time lapse:
zh_hans: 脸部聚合完成，用时

source: Clustering distance
zh_hans: 聚合距离阈值

source: Clusters: %lld
zh_hans: 面部聚合：%lld

source: Compare to:
zh_hans: 对比对象：

source: Condition:
zh_hans: 条件：

source: Conditional Select
zh_hans: 条件选区

source: Confidence:
zh_hans: 置信度：

source: Confirm
zh_hans: 确认

source: Confirm to delete %@? This will make all faces attached to this frame removed from the network.
zh_hans: 确定要删除%@吗？这将导致所有与该帧图像联系的脸部图像被删除。

source: Confirm to delete %lld selected faces from the network?
zh_hans: 确认要从网络中清除%lld张选中的面部吗？

source: Console
zh_hans: 信息

source: Constant
zh_hans: 常量

source: contains
zh_hans: 包含

source: Create
zh_hans: 确认创建

source: Create an Empty Face Attribute
zh_hans: 创建一个空白的属性栏目

source: Create Empty
zh_hans: 创建空白属性

source: Custom CoreML
zh_hans: 本地CoreML模型

source: Decoding URL file...
zh_hans: 正在读取URL文件...

source: Default (Optional)
zh_hans: 默认值（可选）

source: Default 1
zh_hans: 默认为1

source: Delete
zh_hans: 删除

source: Delete Face
zh_hans: 删除面部

source: Delete Frame
zh_hans: 删除帧图像

source: Deleting attribute and its references in faces
zh_hans: 正在删除属性和面部数据中的参考

source: Deselect
zh_hans: 取消选取

source: Details...
zh_hans: 详细信息...

source: Distance:
zh_hans: 距离：

source: Do you really wish to remove the field %@ from the network? This action is irreversible and will delete all references to the field in face files.
zh_hans: 你确定要将属性%@从网络中移除吗？这个操作会造成不可逆的结果并且会导致面部数据中对该属性的参考全部被删除。

source: Edit Multple Faces
zh_hans: 批量编辑选区面部

source: Edit Selected
zh_hans: 编辑选区

# Editing %@ of %@
source: Editing %1$@ of %2$@
zh_hans: 正在编辑%2$@面部的%1$@属性

source: Empty Template
zh_hans: 空白模版

source: equal to
zh_hans: 等于

source: Error
zh_hans: 错误

source: Error:
zh_hans: 错误信息：

source: Exit
zh_hans: 退出

source: Export CSV
zh_hans: 导出CSV

source: Export Full Face Images
zh_hans: 输出高清面部图像

source: Faces:
zh_hans: 编辑面部：

source: Faces: %lld
zh_hans: 面部：%lld

source: Failed to allocate memory for rendering face network. Please reduce the network size.
zh_hans: 不能为初始化GPU脸部渲染管线分配内存。请减少网络所包含的脸部。

source: Failed to analyse frame at position %lf second
zh_hans: 不能分析%lf处截取的图像

source: Failed to create buffer for cluster rendering
zh_hans: 不能为面部聚合渲染分配内存

source: Failed to create command buffer or encoder
zh_hans: 创建GPU缓冲失败

source: Failed to import due to empty column name at column %lld.
zh_hans: 不能导入有空白列名称的表格（位置%lld）

source: Failed to initialise Metal 3 environment.
zh_hans: 不能初始化Metal 3。

source: Failed to initialise ONet model for MTCNN pipeline
zh_hans: 不能初始化MTCNN管线的ONet模型

source: Failed to initialise PNet model for MTCNN pipeline
zh_hans: 不能初始化MTCNN管线的PNet模型

source: Failed to initialise RNet model for MTCNN pipeline
zh_hans: 不能初始化MTCNN管线的RNet模型

source: Failed to load Facenet model
zh_hans: 不能加载Facenet模型

source: Failed to load PNet model
zh_hans: 不能加载PNet模型

source: Failed to read file as text.
zh_hans: 不能讲文件读取为文本。

source: Failed to save clusters.
zh_hans: 不能保存聚合。

source: Failed to save face update for
zh_hans: 不能更新面部

source: Failed to save thumbnail for frame %@
zh_hans: 不能为%@帧保存预览图

source: Failed to save updated table, message:
zh_hans: 保存表格失败，错误信息：

source: Failed to update face network.
zh_hans: 网络更新失败。

source: false
zh_hans: 否

source: Fatal error: Cannot load the main network of this project! Error descrption: %@
zh_hans: 错误：不能加载项目的主要网络！错误描述：%@

source: Filled Template
zh_hans: 参考模版

source: Format:
zh_hans: 格式

source: frame
zh_hans: 帧

source: Frame downsampling: %f%%
zh_hans: 帧图缩放：%f%%

source: Frame scaling:
zh_hans: 图像缩放：

source: Frames
zh_hans: 帧截图

source: From:
zh_hans: 取值：

source: Full Table
zh_hans: 完整表格文件

source: height
zh_hans: 高度

source: Height
zh_hans: 高

# Help ImportProject
source: Import from an existing project
zh_hans: 加载已有项目的保存文件

# Help ImportVideo
source: Import a video file to start a new project
zh_hans: 导入视频以开启新项目

source: Hidden
zh_hans: 隐藏

source: Import CSV
zh_hans: 导入CSV

source: Import JPG/PNG
zh_hans: 导入JPG/PNG

# Import Video File
source: Import Video
zh_hans: 导入视频

source: Importing frame images...
zh_hans: 正在导入帧图像

source: In pixel, optional
zh_hans: 以像素为单位，可空

source: Input attribute must a vector
zh_hans: 输入的属性必须是向量

source: Input vector must have more than 1 dimensions for dimension reduction
zh_hans: 输入的向量需要两个或以上维度才能进行降维分析

source: Invalid input attribute
zh_hans: 无效的输入属性

source: is contained by
zh_hans: 被包含在

source: is empty
zh_hans: 为空值

source: Is:
zh_hans: 是否为：

source: Landmark Indices
zh_hans: 特征点编号

source: Landmark Lines
zh_hans: 特征点连线

source: length
zh_hans: 长度

source: Lines
zh_hans: 线条

source: Load a Local CoreML Model
zh_hans: 加载一个本地的CoreML模型

source: Load a network before reading clusters
zh_hans: 读取脸部聚合需要依赖于网络

# Load Existing Project
source: Load Project
zh_hans: 读取项目文件

source: MacOS Face Clustering Toolkit
zh_hans: MacOS视频面部分析工具

source: Media file: %@
zh_hans: 媒体文件：%@

source: Media Properties
zh_hans: 媒体属性

source: Message
zh_hans: 信息

source: Model:
zh_hans: CoreML模型：

source: Name for confidence attribute
zh_hans: 保存置信度数据的属性名称

source: Name for result attribute
zh_hans: 保存属性的名称

source: Name root for saved attributes
zh_hans: 保存属性参考的名称前缀

source: Network
zh_hans: 网络试图

source: Network display positioning attribute:
zh_hans: 网络可视化位置参考：

source: Network Overview
zh_hans: 网络预览

source: No enough data samples to perform dimension reduction
zh_hans: 没有足够的数据样本以进行降维分析

source: No face images found in all extracted video frames. Redirecting to the import menu.
zh_hans: 在提取的视频关键帧中未识别出有效面部图像。程序将返回加载界面。

source: None
zh_hans: 不显示

source: OK
zh_hans: 确认

source: Overview
zh_hans: 概览

source: Parse Variable
zh_hans: 转换数值

source: Path: %@
zh_hans: 路径：%@

source: Perform T-SNE dimension reduction for "%@"
zh_hans: 为“%@”向量进行降维分析（T-SNE）

source: Performing Facenet512 prediction...
zh_hans: 正在使用Facenet512分析面部...

source: Please load a local CoreML file first
zh_hans: 请先加载一个本地的CoreML模型

source: Please select a Vector attribute in the table header to perform T-SNE on.
zh_hans: 请在表格上方的属性列表中选择一个向量类型的数据来进行T-SNE分析。

source: Polygon
zh_hans: 多边形

source: Proceed
zh_hans: 继续

source: Process
zh_hans: 处理视频

source: Processing faces with %@...
zh_hans: 正在使用%@分析面部数据...

source: Read from dimension:
zh_hans: 从维度读取：

source: Read from:
zh_hans: 取值：

source: real dimension count
zh_hans: 真实维度数

source: Redetect
zh_hans: 重新检测

source: Redirect
zh_hans: 返回

source: Remove
zh_hans: 移除

source: Replacing Existing Files
zh_hans: 正在移除之前的文件

source: Reset
zh_hans: 重置视点

source: Resize face to:
zh_hans: 将面部大小调整为：

source: Resolution
zh_hans: 分辨率

source: Resolution 0x0, 24 fps
zh_hans: 分辨率 0x0, 24 fps

source: Results for %lld faces successfully saved
zh_hans: %lld张面部的分析结果保存成功

source: Sampling interval: %f sec
zh_hans: 采样区间：%f秒

source: Save attributes as:
zh_hans: 将属性保存为：

source: Save Project
zh_hans: 保存项目

source: Saved frame images: %lld
zh_hans: 保存的帧图片：%lld

source: Saved project to
zh_hans: 保存项目至

source: Saved table at
zh_hans: 表格保存至：

source: Saving CSV...
zh_hans: 正在保存CSV…

source: Saving full size face images...
zh_hans: 正在保存完整面部图像...

source: second
zh_hans: 秒

source: Select Faces According to Condition:
zh_hans: 根据条件批量选择面部

source: Selected face:
zh_hans: 当前面部图像：

source: Show deactivated
zh_hans: 显示已禁用面部

source: Skipping following attributes due to its type being preserved:
zh_hans: 以下列因标记为预留类型，已被跳过：

source: Skipping following cells due to corrupted data format:
zh_hans: 以下表格因格式错误，已被跳过：

source: Skipping following lines due to missing identifier attribute (%@):
zh_hans: 以下行因缺失有效ID(列："%@")，已被跳过：

source: Specified attribute name has been used
zh_hans: 使用的变量名称已经被占用

source: Success
zh_hans: 成功

source: Successful
zh_hans: 操作成功

source: Successfully compiled
zh_hans: 编译成功

source: Successfully imported %1$lld attribute(s) into the network, with %2$lld attribute(s), %3$lld line(s), and %4$lld cell(s) skipped.
zh_hans: 成功导入%1$lld组数据至网络，已跳过%2$lld列、%3lld行、%4$lld格。

# Successfully saved %lld images at %@.
source: Successfully saved %1$lld images at %2$@.
zh_hans: 成功将%1$lld张图片保存于%2$@

# Successfully saved T-SNE %lldD reduction for %@ as attribute %@.
source: Successfully saved T-SNE %1$lldD reduction for %2$@ as attribute %3$@.
zh_hans: 成功保存了%2$a的%1$lld维T-SNE降维处理结果至网络属性“%3$@”

source: Target dimension:
zh_hans: 目标维数：

source: Terminate
zh_hans: 终止

source: The selected attribute is not of Vector type.
zh_hans: 选定的属性不是向量。

source: There are one or more attribute names conflicting with existing attributes in the network. Confirming this action will result in these attributes to be replaced. Continue?
zh_hans: 新输入的属性名称中有一个或多个与网络中现有属性的名称冲突，继续当前操作会导致这些属性被替换。是否继续？

source: There are too many folder created for video %@ in the workspace. Please clear the workspace before processing.
zh_hans: 视频工作目录中已经创建了过多%@的结果文件。请在继续前清理视频工作目录。

source: There is an error when compiling the CoreML model: %@
zh_hans: CoreML模型编译错误：%@

# This action will replace the %lld jpg files in %@. Confirm to proceed?
source: This action will replace the %1$lld jpg files in %2$@. Confirm to proceed?
zh_hans: 输出图像将导致%2$@文件夹中的%1$lld个jpg文件被移除，确认继续吗？

source: Time lapse %lf
zh_hans: 用时%lf

source: To Dimension:
zh_hans: 写入维度：

source: true
zh_hans: 是

source: Type
zh_hans: 数据类型

source: Unidentifiable attribute type "%@"
zh_hans: 不能识别变量类型"%@"

source: Updating network...
zh_hans: 正在更新网络...

source: Updating references in face files...
zh_hans: 正在更新面部数据...

source: Video Preview Frame
zh_hans: 视频预览范围

# View: %@, %@, %@
source: View: %1$@, %2$@, %3$@
zh_hans: 视点：%1$@, %2$@, %3$@

source: Warning
zh_hans: 警告

source: Warning: Loading a network with no faces
zh_hans: 警告：正在加载一个没有面部的网络

source: width
zh_hans: 宽度

source: Width
zh_hans: 宽

source: With:
zh_hans: 运算对象：

source: Write to dimension:
zh_hans: 写入维度：

source: Write to:
zh_hans: 写入：

source: Writing results...
zh_hans: 正在保存...

source: Writing to %@
zh_hans: 写入属性%@

source: Writing to type: %@
zh_hans: 正在赋值的类型：%@
